- pandas introduction
- creating series data
- creating data frames
- accessing data from series/data frame
- reading data from environment
- explore data

# Pandas inroduction
- developed in 2008 by mickney
- used for analzing,cleaning,exploring and manipulating data

## Pandas can do
- finding the correlation
- handling with missing values
- avg,max,min
- plotting

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sanjusruthi\anaconda3\lib\site-packages (1.2.4)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pytz>=2017.3 in c:\users\sanjusruthi\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\sanjusruthi\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\sanjusruthi\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in c:\users\sanjusruthi\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas

In [3]:
pandas.__version__

'1.2.4'

In [4]:
import pandas as pd

## Series
- list
- tuple
- numpy array

In [11]:
# series object with list
s1=pd.Series([1,2,3,"apssdc"])
print(s1)
print(type(s1))

0         1
1         2
2         3
3    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [15]:
s1=pd.Series([1,2,3,"apssdc"],index=['x1','x2','x3','x4'])
print(s1)
print(type(s1))

x1         1
x2         2
x3         3
x4    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [16]:
# series object with tuple
s2=pd.Series((1,2,3,4))
print(s2)
s2.index=[11,12,13,14]
print(s2)

0    1
1    2
2    3
3    4
dtype: int64
11    1
12    2
13    3
14    4
dtype: int64

In [17]:
# series object with numpy array
import numpy as np
s3=pd.Series(np.arange(1,10))
print(s3)
print(type(s3))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
<class 'pandas.core.series.Series'>

In [18]:
s1.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [19]:
s2.index

Int64Index([11, 12, 13, 14], dtype='int64')

In [14]:
s3.index

RangeIndex(start=0, stop=9, step=1)

In [22]:
s1

x1         1
x2         2
x3         3
x4    apssdc
dtype: object

In [24]:
s1['x2']

2

In [25]:
s1['x1'],s1['x3']

(1, 3)

In [29]:
s3.min()

1

In [30]:
s3.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
dtype: int32

## pandas date_range
- to work with date and time formates we usse date_range
#### Syntax
- pandas.date_range()

In [31]:
import pandas as pd
d1=pd.date_range('01-01-2021',periods=10)
print(d1)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [32]:
import pandas as pd
d2=pd.date_range('01-01-2021',periods=10,freq='1H')
print(d2)

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [34]:
import pandas as pd
d3=pd.date_range('01-01-2021',periods=20,freq='24H')
print(d3)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20'],
              dtype='datetime64[ns]', freq='24H')

In [35]:
import pandas as pd
d4=pd.date_range('01-01-2021',end='01-02-2021',freq='5s')
print(d4)

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:00:05',
               '2021-01-01 00:00:10', '2021-01-01 00:00:15',
               '2021-01-01 00:00:20', '2021-01-01 00:00:25',
               '2021-01-01 00:00:30', '2021-01-01 00:00:35',
               '2021-01-01 00:00:40', '2021-01-01 00:00:45',
               ...
               '2021-01-01 23:59:15', '2021-01-01 23:59:20',
               '2021-01-01 23:59:25', '2021-01-01 23:59:30',
               '2021-01-01 23:59:35', '2021-01-01 23:59:40',
               '2021-01-01 23:59:45', '2021-01-01 23:59:50',
               '2021-01-01 23:59:55', '2021-01-02 00:00:00'],
              dtype='datetime64[ns]', length=17281, freq='5S')

In [38]:
import pandas as pd
date=pd.Series(pd.date_range(start='01-01-2021',end='01-02-2021',freq='24h'))
print(date)
print(type(date))

0   2021-01-01
1   2021-01-02
dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

In [39]:
import pandas as pd
date=pd.Series(pd.date_range(start='01-01-2021',end='01-02-2021',freq='5s'))
print(date)
print(type(date))

0       2021-01-01 00:00:00
1       2021-01-01 00:00:05
2       2021-01-01 00:00:10
3       2021-01-01 00:00:15
4       2021-01-01 00:00:20
                ...
17276   2021-01-01 23:59:40
17277   2021-01-01 23:59:45
17278   2021-01-01 23:59:50
17279   2021-01-01 23:59:55
17280   2021-01-02 00:00:00
Length: 17281, dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

## data frames
- it is similar to 2D type of data
we can create using
- list
- tuple
- numpy array
    - String,float,complex-string/object
### syntax
- pandas.DataFrame

In [50]:
import pandas as p1
import numpy as np
df1=p1.DataFrame([[1,2,3],[4,5,"apssdc"]])
df2=p1.DataFrame((1,3),(1,2))
df3=p1.DataFrame({"k1":[11,22],"m1":[23,24]})
df4=p1.DataFrame(np.array([[1,2,5],[8,7,6]]))

In [51]:
print(df1)

   0  1       2
0  1  2       3
1  4  5  apssdc

In [52]:
print(df2)

   0
1  1
2  3

In [59]:
df3

   k1  m1
0  11  23
1  22  24

In [58]:
df4

   0  1  2
0  1  2  5
1  8  7  6

In [55]:
print(type(d4))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [57]:
df2=p1.DataFrame(((1,3),(1,2),(3,4)),index=['x','y','z'])
df2

   0  1
x  1  3
y  1  2
z  3  4

In [63]:
df3.columns=["column1","column2"]
df3.index=["row1","row2"]
df3

      column1  column2
row1       11       23
row2       22       24

In [64]:
df3.columns

Index(['column1', 'column2'], dtype='object')

In [65]:
df3.index

Index(['row1', 'row2'], dtype='object')

In [75]:
import numpy as np
d1={"rollno":['18819510'+str(i) for i in range(1,51)],'m1':np.random.randint(1,101,50),'m2':np.random.randint(1,101,50),'m3':np.random.randint(1,101,50)}
df=pd.DataFrame(d1)
df

        rollno   m1  m2  m3
0    188195101   43  21  30
1    188195102   71  35  25
2    188195103   17  59  77
3    188195104   48  74  26
4    188195105   14  17  52
5    188195106   69  42  58
6    188195107   23  67  63
7    188195108   77  66   8
8    188195109   86  18   3
9   1881951010   79  17  99
10  1881951011    7  42  26
11  1881951012    5  85   3
12  1881951013   54  21  48
13  1881951014   71  91  80
14  1881951015   15  85  63
15  1881951016   99  86  23
16  1881951017   70  40  31
17  1881951018   68  57  48
18  1881951019   93   6  35
19  1881951020   18  83  65
20  1881951021   55  13  91
21  1881951022   16  82  47
22  1881951023    3  81  22
23  1881951024   24  72   9
24  1881951025   71  45  82
25  1881951026   50  74  17
26  1881951027   95  50   7
27  1881951028   20  99  11
28  1881951029   68  47  84
29  1881951030   21  20  63
30  1881951031   58  13  51
31  1881951032   17  50  17
32  1881951033   73  79  24
33  1881951034  100  80  93
34  1881951035    4  28  67
35  1881951036   72  18  96
36  1881951037   89  30   4
37  1881951038   17  74   9
38  1881951039   53  10  74
39  1881951040   86  75  15
40  1881951041   90  43  87
41  1881951042   16  34  20
42  1881951043   26   9  46
43  1881951044   71  47  76
44  1881951045   66   9  17
45  1881951046   89  50  41
46  1881951047    2  54  80
47  1881951048   87  28   8
48  1881951049   81  65  46
49  1881951050   75  71  91

In [76]:
df.head()

      rollno  m1  m2  m3
0  188195101  43  21  30
1  188195102  71  35  25
2  188195103  17  59  77
3  188195104  48  74  26
4  188195105  14  17  52

In [77]:
df.tail()

        rollno  m1  m2  m3
45  1881951046  89  50  41
46  1881951047   2  54  80
47  1881951048  87  28   8
48  1881951049  81  65  46
49  1881951050  75  71  91

In [78]:
df.shape

(50, 4)

## Accessing data from dataframe
- index
- slicing

In [79]:
df.head()

      rollno  m1  m2  m3
0  188195101  43  21  30
1  188195102  71  35  25
2  188195103  17  59  77
3  188195104  48  74  26
4  188195105  14  17  52

In [80]:
df['rollno']

0      188195101
1      188195102
2      188195103
3      188195104
4      188195105
5      188195106
6      188195107
7      188195108
8      188195109
9     1881951010
10    1881951011
11    1881951012
12    1881951013
13    1881951014
14    1881951015
15    1881951016
16    1881951017
17    1881951018
18    1881951019
19    1881951020
20    1881951021
21    1881951022
22    1881951023
23    1881951024
24    1881951025
25    1881951026
26    1881951027
27    1881951028
28    1881951029
29    1881951030
30    1881951031
31    1881951032
32    1881951033
33    1881951034
34    1881951035
35    1881951036
36    1881951037
37    1881951038
38    1881951039
39    1881951040
40    1881951041
41    1881951042
42    1881951043
43    1881951044
44    1881951045
45    1881951046
46    1881951047
47    1881951048
48    1881951049
49    1881951050
Name: rollno, dtype: object

In [82]:
df[["rollno",'m2']]

        rollno  m2
0    188195101  21
1    188195102  35
2    188195103  59
3    188195104  74
4    188195105  17
5    188195106  42
6    188195107  67
7    188195108  66
8    188195109  18
9   1881951010  17
10  1881951011  42
11  1881951012  85
12  1881951013  21
13  1881951014  91
14  1881951015  85
15  1881951016  86
16  1881951017  40
17  1881951018  57
18  1881951019   6
19  1881951020  83
20  1881951021  13
21  1881951022  82
22  1881951023  81
23  1881951024  72
24  1881951025  45
25  1881951026  74
26  1881951027  50
27  1881951028  99
28  1881951029  47
29  1881951030  20
30  1881951031  13
31  1881951032  50
32  1881951033  79
33  1881951034  80
34  1881951035  28
35  1881951036  18
36  1881951037  30
37  1881951038  74
38  1881951039  10
39  1881951040  75
40  1881951041  43
41  1881951042  34
42  1881951043   9
43  1881951044  47
44  1881951045   9
45  1881951046  50
46  1881951047  54
47  1881951048  28
48  1881951049  65
49  1881951050  71

## iloc
- index location

## loc
- lable names

In [83]:
df.head()

      rollno  m1  m2  m3
0  188195101  43  21  30
1  188195102  71  35  25
2  188195103  17  59  77
3  188195104  48  74  26
4  188195105  14  17  52

In [84]:
df.iloc[0]

rollno    188195101
m1               43
m2               21
m3               30
Name: 0, dtype: object

In [85]:
df.iloc[0:10]

       rollno  m1  m2  m3
0   188195101  43  21  30
1   188195102  71  35  25
2   188195103  17  59  77
3   188195104  48  74  26
4   188195105  14  17  52
5   188195106  69  42  58
6   188195107  23  67  63
7   188195108  77  66   8
8   188195109  86  18   3
9  1881951010  79  17  99

In [86]:
df.iloc[0:10][['rollno','m1']]

       rollno  m1
0   188195101  43
1   188195102  71
2   188195103  17
3   188195104  48
4   188195105  14
5   188195106  69
6   188195107  23
7   188195108  77
8   188195109  86
9  1881951010  79

In [92]:
student_df=df.set_index("rollno")
student_df.head()

           m1  m2  m3
rollno
188195101  43  21  30
188195102  71  35  25
188195103  17  59  77
188195104  48  74  26
188195105  14  17  52

In [93]:
df.head()

      rollno  m1  m2  m3
0  188195101  43  21  30
1  188195102  71  35  25
2  188195103  17  59  77
3  188195104  48  74  26
4  188195105  14  17  52

In [98]:
student_df.loc['1881951041']

m1    90
m2    43
m3    87
Name: 1881951041, dtype: int32

In [97]:
student_df.loc['1881951041']['m1']

90

In [100]:
student_df.loc['1881951041':'1881951045'][['m1','m2']]

            m1  m2
rollno
1881951041  90  43
1881951042  16  34
1881951043  26   9
1881951044  71  47
1881951045  66   9

In [103]:
student_df["sum_columns"]=student_df.sum(axis='columns')
student_df["sum_m1"]=student_df['m1'].sum()
student_df.head()

           m1  m2  m3  sum_columns  sum_m1
rollno
188195101  43  21  30          282    2622
188195102  71  35  25          393    2622
188195103  17  59  77          459    2622
188195104  48  74  26          444    2622
188195105  14  17  52          249    2622